Loads a family and all its types/symbols.
 Overload List
Name  |   Description
LoadFamily(String)
 Loads an entire family and all its types/symbols into the document.
 (Inherited from  Document  .)
LoadFamily(Document)
 Loads the contents of this family document into another document.
 (Inherited from  Document  .)
LoadFamily(String, Family )
 Loads an entire family and all its types/symbols into the document and provides a reference to the loaded family.
 (Inherited from  Document  .)
LoadFamily(Document, IFamilyLoadOptions)
 Loads the contents of this family document into another document.
 (Inherited from  Document  .)
LoadFamily(String, IFamilyLoadOptions, Family )
 Loads an entire family and all its types/symbols into the document and provides a reference to the loaded family.
 (Inherited from  Document  .)
 See Also
  DocumentEntryPoint Class
  DocumentEntryPoint Members
  Autodesk.Revit.DB.Macros Namespace